Autodesk.Revit.DB.Structure.RebarCurvesData.SetDistributionPath(System.Collections.Generic.IList{Autodesk.Revit.DB.Curve})
Sets a new distribution path to be applied to the rebar. This information is set to the rebar after the API execution is finished successfully.
Remarks:
For a free form rebar set the distance between two consecutive bars may be different if it is calculated between different points on bars.
The distribution path is an array of curves with the property that based on these curves the set was calculated to respect the layout rule and number of bars or spacing.
path:
Input curves that describe the new path.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018

Autodesk.Revit.DB.Structure.RebarCurvesData.AddBarGeometry(Autodesk.Revit.DB.CurveLoop)
Adds a new bar to the new rebar geometry. This information is set to the rebar after the API execution is finished successfully.
Remarks:
This function can fail due to following reasons:
CurveLoop is empty.
CurveLoop contains an unbounded curve.
A rebar constructed from curves can't be bent according to the bending radius.
curves:
Curves describing one bar in the set.
Returns:
Returns Success if everything is ok, otherwise the failure reason.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Incorrect number of bar geometry for the current layout.
Since:
2018

Autodesk.Revit.DB.Structure.RebarCurvesData.AddBarGeometry(System.Collections.Generic.IList{Autodesk.Revit.DB.Curve})
Adds a new bar to the new rebar geometry. This information is set to the rebar after the API execution is finished successfully.
Remarks:
This function will can fail due to following reasons:
One or more of the input curves was null.
One or more of the input curves was unbounded.
Curves doesn't form a valid curve loop, it forms 0, 2 or more curve loops.
A rebar constructed from curves can't be bent according to the bending radius.
curves:
Curves describing one bar in the set.
Returns:
Returns Success if everything is ok, otherwise the failure reason.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Incorrect number of bar geometry for the current layout.
Since:
2018